perpustakaan/app/Controllers/Anggota.php

    public function index()
    {
        $model = new AnggotaModel();
        $data['title'] = 'Data Anggota';
        $data['anggota'] = $model->findAll();
---
SELECT *
FROM `anggota`