perpustakaan/app/Controllers/Buku.php

SELECT *
FROM `buku`
---
    public function index()
    {
        $model = new BukuModel();
        $data['title'] = 'Data Buku';
        $data['buku'] = $model->findAll();