app/Controllers/Buku.php

    public function index()
    {
        $model = new BukuModel();
        $data['title'] = 'Data Buku';
        $data['buku'] = $model->findAll();
---
SELECT *
FROM `buku`

    public function edit($id)
    {
        $model = new BukuModel();
        $buku = $model->find($id);
---
SELECT *
FROM `buku`
WHERE `buku`.`id` = '1'