app/Models/PeminjamanModel.php

    public function getAll()
    {
        return $this->select('peminjaman.*, buku.judul AS judul_buku, anggota.nama AS anggota_nama')
                    ->join('buku', 'buku.id = peminjaman.buku_id')
                    ->join('anggota', 'anggota.id = peminjaman.anggota_id')
                    ->findAll();
---
SELECT `peminjaman`.*, `buku`.`judul` AS `judul_buku`, `anggota`.`nama` AS `anggota_nama`
FROM `peminjaman`
JOIN `buku` ON `buku`.`id` = `peminjaman`.`buku_id`
JOIN `anggota` ON `anggota`.`id` = `peminjaman`.`anggota_id`